<?php
/*************************************************************
    HaoYi (C)2017 - 2020 myhaoyi.com

*************************************************************/

class MobileMonitorAction extends Action
{
  public function _initialize() {
    // 创建一个新的移动检测对象...
    $this->m_detect = new Mobile_Detect();
    //////////////////////////////////////////////
    // 电脑端访问了移动端页面，直接对页面进行跳转...
    //////////////////////////////////////////////
    if( !$this->m_detect->isMobile() ) {
      header("location:".__APP__.'/Home/index');
    }
  }
  /**
  +----------------------------------------------------------
  * 默认操作，进行页面分发...
  +----------------------------------------------------------
  */
  public function index()
  {
    echo "Mobile-Cloud-Monitor";
  }
}
?>